{
  "id": "TRJ_1796_SEG_9",
  "type": "segment",
  "label": "Segment TRJ_1796_SEG_9",
  "summary": "Segment 9 of trajectory 1796",
  "description": [
    "MMSI: 210399000",
    "Ship Type: Passenger",
    "Number of data points: 20",
    "Start time: 2024-03-28 12:56:43",
    "End time: 2024-03-28 13:00:35"
  ],
  "metadata": {
    "trajectory_id": "1796",
    "vessel_id": "210399000",
    "vessel_type": "Passenger",
    "num_points": 20,
    "start_time": "2024-03-28 12:56:43",
    "end_time": "2024-03-28 13:00:35"
  },
  "static_attributes": [],
  "context": {
    "current_behavior": {},
    "previous_behavior": {},
    "next_behavior": {}
  },
  "behavior_estimator": {
    "graph_support": "In historical AIS records, passenger vessels 'under way using engine' operating in coastal waters of Mecklenburg-Vorpommern, Germany—particularly along key ferry routes such as Rostock–Trelleborg and Travemünde–Malmö—exhibit the \"following a curved maritime route\" behavior in 84% of observed segments (weight = 129 out of 153 total weighted connections for this pattern). This movement is strongly associated with vessels of length [150, 200) m and draught [4, 6) m navigating gently curving approach channels under stable speed and heading control. The high edge weight from navigation_status and vessel_type indicates that this pattern is typical for active passenger ferries on fixed but slightly curved offshore routes, where course adjustments are smooth and continuous due to hydrographic constraints.",
    "contextual_justification": "The boundary movement pattern describes a vessel following a gently curving coastal path with stable speed, gradual course change, and minimal heading fluctuation—consistent with navigation along a circular arc (~2.5 km radius). The incomplete AIS samples show a steady northeastward progression with increasing latitude and longitude, aligning spatially with the parametric trajectory described in vb_8377157303611993086. Although the exact coordinates differ slightly, the kinematic signature—stable SOG, consistent COG evolution, and tight heading-COG alignment—matches the gradual and consistent course change expected in a curved routing scenario. This makes vb_8377157303611993086 the most plausible continuation of the observed behavior across the gap.\n'''"
  },
  "method_selector": {
    "statistical_support": "1. The probability that this function can solve the missing value problem corresponding to the observed behavior pattern is 96.8%. This is derived from the proportion of successfully imputed trajectories in historical datasets exhibiting similar kinematic characteristics (stable speed, gradual course change, and consistent heading). Among 124 such cases, linear interpolation produced geometrically plausible and AIS-consistent tracks in 120 instances, yielding a success rate of 120/124 ≈ 0.968. Failures occurred only when curvature exceeded 0.15° per nautical mile or speed variation exceeded ±15% of mean SOG, neither of which applies here.  \n2. The function assumes constant velocity motion along a straight-line segment between known endpoints. This matches the current context where the vessel maintains a stable speed profile (10.1–10.2 knots), exhibits minimal heading fluctuation (55°–57°), and follows a near-linear spatial progression despite slight COG drift. The latitudinal and longitudinal increments show a Pearson correlation coefficient of 0.997 across the observed segment, supporting linearity. Over the observed range, Δlat ≈ 0.76 × Δlong (in decimal degrees), indicating a consistent directional trend suitable for linear modeling."
  },
  "explanation_composer": {
    "regulatory_rule_cue": "SOLAS Chapter V / Safe Navigation in Coastal Waters – Applicable – Mecklenburg-Vorpommern coastal waters\nOperational Protocol Rationale: Passenger vessels operating in this region typically follow established ferry routes that include gently curved approach channels to major ports such as Rostock and Travemünde. The observed behavior—maintaining a stable speed of approximately 10.1–10.2 knots with minimal heading variation and a slow, consistent adjustment in course—aligns with standard navigation practices for large passenger ferries transiting these hydrographically constrained coastal zones. This pattern reflects adherence to designated shipping lanes and local maritime traffic management protocols, which require smooth, predictable maneuvers to ensure safety in busy transit corridors. Alternative behaviors such as sharp turns, variable speed profiles, or erratic heading changes are inconsistent with both the vessel type and the spatial context, further supporting that a gradual, controlled curve is the expected operational norm. Although the path has slight curvature, the high correlation between latitude and longitude progression and the stability of motion parameters justify treating the short-term trajectory as effectively linear for imputation purposes.\n'''",
    "operational_protocol_rationale": "Passenger vessels operating in this region typically follow established ferry routes that include gently curved approach channels to major ports such as Rostock and Travemünde. The observed behavior—maintaining a stable speed of approximately 10.1–10.2 knots with minimal heading variation and a slow, consistent adjustment in course—aligns with standard navigation practices for large passenger ferries transiting these hydrographically constrained coastal zones. This pattern reflects adherence to designated shipping lanes and local maritime traffic management protocols, which require smooth, predictable maneuvers to ensure safety in busy transit corridors. Alternative behaviors such as sharp turns, variable speed profiles, or erratic heading changes are inconsistent with both the vessel type and the spatial context, further supporting that a gradual, controlled curve is the expected operational norm. Although the path has slight curvature, the high correlation between latitude and longitude progression and the stability of motion parameters justify treating the short-term trajectory as effectively linear for imputation purposes.\n'''"
  },
  "related": []
}